In [115]:
import pandas as pd
import json
import requests

In [116]:
df1=pd.read_csv("usa_states_latlong.csv")

In [117]:
df1.head()

  code   latitude   longitude       state
0   AK  63.588753 -154.493062      Alaska
1   AL  32.318231  -86.902298     Alabama
2   AR  35.201050  -91.831833    Arkansas
3   AZ  34.048928 -111.093731     Arizona
4   CA  36.778261 -119.417932  California

In [122]:
r = requests.get("https://api.census.gov/data/2019/pep/charagegroups?get=NAME,POP&HISP=0&for=state:*&key=64f1dfb2f21e446d237909b1045fcde98e66d4f8")
x = r.json()

df2 = pd.DataFrame(x)
df2.head()

             0        1     2      3
0         NAME      POP  HISP  state
1  Mississippi  2976149     0     28
2     Missouri  6137428     0     29
3      Montana  1068778     0     30
4     Nebraska  1934408     0     31

In [123]:

df2 = df2.rename(columns=df2.iloc[0])
df2.head()

          NAME      POP  HISP  state
0         NAME      POP  HISP  state
1  Mississippi  2976149     0     28
2     Missouri  6137428     0     29
3      Montana  1068778     0     30
4     Nebraska  1934408     0     31

In [128]:
total_merged_inner = df1.merge(df2, left_on="state" , right_on="NAME")

In [130]:
total_merged_inner.head()

  code   latitude   longitude     state_x        NAME       POP HISP state_y
0   AK  63.588753 -154.493062      Alaska      Alaska    731545    0      02
1   AL  32.318231  -86.902298     Alabama     Alabama   4903185    0      01
2   AR  35.201050  -91.831833    Arkansas    Arkansas   3017804    0      05
3   AZ  34.048928 -111.093731     Arizona     Arizona   7278717    0      04
4   CA  36.778261 -119.417932  California  California  39512223    0      06

In [131]:
r = requests.get("https://api.census.gov/data/2019/pep/charagegroups?get=NAME,POP&HISP=1&for=state:*&key=64f1dfb2f21e446d237909b1045fcde98e66d4f8")
x = r.json()

df3 = pd.DataFrame(x)
df3.head()

             0        1     2      3
0         NAME      POP  HISP  state
1  Mississippi  2876039     1     28
2     Missouri  5868720     1     29
3      Montana  1025489     1     30
4     Nebraska  1714763     1     31

In [132]:
df3 = df3.rename(columns=df3.iloc[0])
df3.head()

          NAME      POP  HISP  state
0         NAME      POP  HISP  state
1  Mississippi  2876039     1     28
2     Missouri  5868720     1     29
3      Montana  1025489     1     30
4     Nebraska  1714763     1     31

In [134]:
nonHispanic_merged_inner = df1.merge(df3, left_on="state" , right_on="NAME")
nonHispanic_merged_inner.head()

  code   latitude   longitude     state_x        NAME       POP HISP state_y
0   AK  63.588753 -154.493062      Alaska      Alaska    678333    1      02
1   AL  32.318231  -86.902298     Alabama     Alabama   4679907    1      01
2   AR  35.201050  -91.831833    Arkansas    Arkansas   2781173    1      05
3   AZ  34.048928 -111.093731     Arizona     Arizona   4968127    1      04
4   CA  36.778261 -119.417932  California  California  23937343    1      06

In [135]:
r = requests.get("https://api.census.gov/data/2019/pep/charagegroups?get=NAME,POP&HISP=2&for=state:*&key=64f1dfb2f21e446d237909b1045fcde98e66d4f8")
x = r.json()

df4 = pd.DataFrame(x)
df4.head()

             0       1     2      3
0         NAME     POP  HISP  state
1  Mississippi  100110     2     28
2     Missouri  268708     2     29
3      Montana   43289     2     30
4     Nebraska  219645     2     31

In [136]:
df4 = df4.rename(columns=df4.iloc[0])
df4.head()

          NAME     POP  HISP  state
0         NAME     POP  HISP  state
1  Mississippi  100110     2     28
2     Missouri  268708     2     29
3      Montana   43289     2     30
4     Nebraska  219645     2     31

In [137]:
Hispanic_merged_inner = df1.merge(df4, left_on="state" , right_on="NAME")
Hispanic_merged_inner.head()

  code   latitude   longitude     state_x        NAME       POP HISP state_y
0   AK  63.588753 -154.493062      Alaska      Alaska     53212    2      02
1   AL  32.318231  -86.902298     Alabama     Alabama    223278    2      01
2   AR  35.201050  -91.831833    Arkansas    Arkansas    236631    2      05
3   AZ  34.048928 -111.093731     Arizona     Arizona   2310590    2      04
4   CA  36.778261 -119.417932  California  California  15574880    2      06